// Ecma script - спецификация, на которой основан js. Типа чертеж, на котором основан язык js. Набор правил и инструкций.
// В js - функция - это вызываемый объект.
// 6 типов примитивных данных - number, string, null, undefined, symbol.
// Все, что не является примитивным типом - является объектом.
// Ecma script - реализуется по принципу общающихся объектов, соответственно все объекты обладают совей иерархией.
// 
// Некотрые функции являются конструкторами. Конструктор - это функция для создания и инициализации новых объектов. Обычно используется
// с оператором new. Каждый конструктор - имеет прототип, который используется для реализации протоипного наследования и реализации 
// разделенных свойств. Также протоип может иметь вложенный прототип низшего порядка. Эта структура называется цепочкой прототипов. 
// prototype chain.
// Конструкторы пишутся с заглавной буквы.
// При создании конструктора - каждый создаваемый объект будет иметь неявную на свойства прототипа объекта - __proto__




